#include<iostream>
#include<stack>
using namespace std;
int main()
{
    int n;

    cin >> n;

    int number; // променлива за въвеждане на поредното число от рецицата

    stack <int> st;

    for (int i = 0; i < n; i++) // щом търсеното число ("мажориращото") се среща повече от n/2 пъти в редицата
    {                           // значи се среща повече пъти, отколкото всички останали числа, взети заедно
        cin >> number;          // винаги, когато вземем 2 различни числа от редицата, само едно може да бъде мажориращото
                                // => ако премахнем 2 различни числа от редицата,
                                // мажориращото ще продължи да се среща повече пъти, отколкото всички останали
        if (st.empty() || st. top() == number) // махаме двойки числа от редицата, докато има такава
                                               //накрая ще останат само числа, равни на мажориращото
            st.push(number);
        else
            st.pop();
    }

    cout << st.top() << endl;

    return 0;

}
